InformationRegisters/КэшВзаимодействияМПЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КэшВзаимодействияМПЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВзаимодействияМПЭПД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторМП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Содержимое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешнийИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторРодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументЭПД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПодключенныеМПЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПодключенныеМПЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторМП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеМПЭПД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПодписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидПодписиМПЭПД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МЧД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОпросаДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидыДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрямойОбмен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьБумажнаяДоверенность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВремяПолученияКодаРегистрации</Name>
					<Comment>Универсальная дата и время получения кода регистрации</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыВзаимодействияМПЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыВзаимодействияМПЭПД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйДокументЭПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовоеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалениеМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСведенийВодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящийПакет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСведенийМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторнаяРегистрацияМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеЭПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписаниеГосключ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвязкаВодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПривязкаВодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкиДополнительныхПолей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СервисВзаимодействияМПЭПДКлиентСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяФормыСостоянияПодключенныхМП() Экспорт
	
	Возврат "Обработка.ВзаимодействиеМПЭПД.Форма.СостояниеПодключенияМП";
	
КонецФункции

Функция ИмяФормыВыборДействияПоДокументу() Экспорт
	
	Возврат "Обработка.ВзаимодействиеМПЭПД.Форма.ВыборДействияПоДокументу";
	
КонецФункции

Функция ВидВзаимодействияСМП(ИмяВида) Экспорт
	
	Возврат ПредопределенноеЗначение("Перечисление.ТипыВзаимодействияМПЭПД." + ИмяВида);
	
КонецФункции

Функция ТекстЗапросаДанныхДокументаПоВерсииМП() Экспорт
	
	Возврат "ВЫБРАТЬ
			|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации,
			|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокументооборота
			|ПОМЕСТИТЬ ВТ_ДОКУМЕНТЫ
			|ИЗ
			|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
			|		ПО ОбъектыУчетаДокументовЭДО.ОбъектУчета = &Документ
			|		И ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент = ЭлектронныйДокументИсходящийЭДО.Ссылка
			|		И ОбъектыУчетаДокументовЭДО.Актуальный = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации,
			|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокументооборота
			|ИЗ
			|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
			|		ПО ОбъектыУчетаДокументовЭДО.ОбъектУчета = &Документ
			|		И ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент = ЭлектронныйДокументВходящийЭДО.Ссылка
			|		И ОбъектыУчетаДокументовЭДО.Актуальный = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КэшВзаимодействияМПЭПД.ДанныеСообщения,
			|	КэшВзаимодействияМПЭПД.ДатаПолучения,
			|	КэшВзаимодействияМПЭПД.Дата,
			|	КэшВзаимодействияМПЭПД.Содержимое,
			|	ПодключенныеМПЭПД.Наименование КАК МобильноеПриложение,
			|	ПодключенныеМПЭПД.Телефоны,
			|	КэшВзаимодействияМПЭПД.ВидСообщения,
			|	ПодключенныеМПЭПД.Идентификатор,
			|	ПодключенныеМПЭПД.Фото,
			|	ПодключенныеМПЭПД.Роль,
			|	ПодключенныеМПЭПД.ВидыДокументов,
			|	ПодключенныеМПЭПД.Удален,
			|	КэшВзаимодействияМПЭПД.ИдентификаторМП,
			|	КэшВзаимодействияМПЭПД.Прочитано
			|ИЗ
			|	РегистрСведений.КэшВзаимодействияМПЭПД КАК КэшВзаимодействияМПЭПД
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДОКУМЕНТЫ
			|		ПО КэшВзаимодействияМПЭПД.ИдентификаторЭДО = ВТ_ДОКУМЕНТЫ.ИдентификаторОрганизации
			|		И КэшВзаимодействияМПЭПД.ИдентификаторДокумента = ВТ_ДОКУМЕНТЫ.ИдентификаторДокументооборота
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодключенныеМПЭПД КАК ПодключенныеМПЭПД
			|		ПО КэшВзаимодействияМПЭПД.ИдентификаторЭДО = ПодключенныеМПЭПД.ИдентификаторЭДО
			|		И КэшВзаимодействияМПЭПД.ИдентификаторМП = ПодключенныеМПЭПД.ИдентификаторМП
			|ГДЕ
			|	КэшВзаимодействияМПЭПД.ДокументЭПД = &Документ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата УБЫВ";
	
КонецФункции

Функция ПредставлениеПустогоЗначенияДанныхМП() Экспорт
	
	Возврат "<не заполнено>";
	
КонецФункции

Функция ТипДокументаМП(ДокументЭПД) Экспорт
	
	Результат = "";
	
	Если ТипЗнч(ДокументЭПД) = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная")
		Или ДокументЭПД = "ЭлектроннаяТранспортнаяНакладная"
		Или ДокументЭПД = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭТрН") Тогда
		Результат = "ETRN";
	ИначеЕсли ТипЗнч(ДокументЭПД) = Тип("ДокументСсылка.ЭлектронныйПутевойЛист")
		Или ДокументЭПД = "ЭлектронныйПутевойЛист"
		Или ДокументЭПД = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭПЛ") Тогда
		Результат = "EPL"; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТитулПоддерживаетсяМобильнымПриложением(ПрефиксТитула) Экспорт
	
	Возврат ПрефиксТитула = "ТитулПеревозчикаПриемка"
		Или ПрефиксТитула = "ТитулПеревозчикаВыдача"
		Или ПрефиксТитула = "ТитулВыпуск"
		Или ПрефиксТитула = "ТитулВыезд"
		Или ПрефиксТитула = "ТитулЗаезд"
		Или ПрефиксТитула = "ТитулМедосмотрПосле";
	
КонецФункции

Функция СоответствиеТитуловТипамМП() Экспорт
	
	Результат = Новый Соответствие;
	
	// ЭТрН
	Результат.Вставить("acceptance", ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул2"));
	Результат.Вставить("unloading", ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул4"));
	
	// ЭПЛ
	Результат.Вставить("ShippingList_medic_before", ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул2"));
	Результат.Вставить("ShippingList_inspection", ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул3"));
	Результат.Вставить("ShippingList_odometr_before", ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул4"));
	Результат.Вставить("ShippingList_odometr_after", ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул5"));
	Результат.Вставить("ShippingList_medic_after", ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул6"));
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеТитуловРоляМП() Экспорт
	
	Результат = Новый Массив;
	
	// ЭТрН
	Результат.Добавить(Новый Структура("Роль, Титул", Pow(2, 4), ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул2")));
	Результат.Добавить(Новый Структура("Роль, Титул", Pow(2, 4), ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул4")));
	
	// ЭПЛ
	Результат.Добавить(Новый Структура("Роль, Титул", Pow(2, 4), ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1")));
	Результат.Добавить(Новый Структура("Роль, Титул", Pow(2, 2), ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул3")));
	Результат.Добавить(Новый Структура("Роль, Титул", Pow(2, 3), ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул4")));
	Результат.Добавить(Новый Структура("Роль, Титул", Pow(2, 3), ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул5")));
	
	Возврат Результат;
	
КонецФункции

Функция АтомарныеРолиМП() Экспорт
	
	Результат = Новый Массив;
	
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Оформитель'"));
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Медработник'"));
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Механик'"));
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Ответственный за показания одометра'"));
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Водитель'"));
	
	Возврат Результат;
	
КонецФункции

Функция АтомарныеВидыДокументовМП() Экспорт
	
	Результат = Новый Массив;
	
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Транспортная накладная'"));
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Путевой лист'"));
	
	Возврат Результат;
	
КонецФункции

Функция ОбязательныеРолиМП() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Pow(2, 4));
	
	Возврат Результат;
	
КонецФункции

Функция ПредставленияРолейМП(Все = Истина, Отбор = Неопределено) Экспорт
	
	Результат = Новый Соответствие;
	
	АтомарныеРоли = АтомарныеРолиМП();	
	ВсегоРолей = АтомарныеРоли.Количество();
	
	РолиПоддерживаемыеМП = РолиПоддерживаемыеМП();
	Если РолиПоддерживаемыеМП.Количество() = 1 Тогда
		ИндексРоли = РолиПоддерживаемыеМП[0];
		Результат.Вставить(Pow(2, ИндексРоли), АтомарныеРоли[ИндексРоли]);	
		Возврат Результат;
	КонецЕсли;
	
	Если Все = Истина Тогда
		Для СчетчикОбщий = 1 По Pow(2, ВсегоРолей) - 1 Цикл
			СчетчикАтомарный = 0;	
			ПредставлениеМассив = Новый Массив;
			СоответствуетОтбору = Ложь;
			Для Каждого Роль Из АтомарныеРоли Цикл
				Если РолиПоддерживаемыеМП.Найти(СчетчикАтомарный) <> Неопределено Тогда				
					РольЧисловая = Pow(2, СчетчикАтомарный);
					Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(СчетчикОбщий, РольЧисловая, ВсегоРолей) Тогда
						//@skip-check typed-value-adding-to-untyped-collection
						ПредставлениеМассив.Добавить(Роль);
						Если Отбор = Неопределено Или СчетчикАтомарный = Отбор Тогда
							СоответствуетОтбору = Истина;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
				СчетчикАтомарный = СчетчикАтомарный + 1;
			КонецЦикла;	
			Если СоответствуетОтбору = Истина И ПредставлениеМассив.Количество() > 0 Тогда
				Результат.Вставить(СчетчикОбщий, СтрСоединить(ПредставлениеМассив, ", "));
			КонецЕсли;
		КонецЦикла;
	Иначе
		СчетчикАтомарный = 0;
		Для Каждого Роль Из АтомарныеРоли Цикл		
			Если РолиПоддерживаемыеМП.Найти(СчетчикАтомарный) <> Неопределено
				И (Отбор = Неопределено Или СчетчикАтомарный = Отбор) Тогда
				РольЧисловая = Pow(2, СчетчикАтомарный);
				Результат.Вставить(РольЧисловая, Роль); 
			КонецЕсли;
			СчетчикАтомарный = СчетчикАтомарный + 1;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставленияВидовДокументовМП(Все = Истина, Отбор = Неопределено) Экспорт
	
	Результат = Новый Соответствие;
	
	АтомарныеВидыДокументов = АтомарныеВидыДокументовМП();
	ВсегоДокументов = АтомарныеВидыДокументов.Количество();
	
	ВидыДокументовПоддерживаемыеМП = ВидыДокументовПоддерживаемыеМП();
	
	Если ВидыДокументовПоддерживаемыеМП.Количество() = 1 Тогда
		ИндексДокумента = ВидыДокументовПоддерживаемыеМП[0];
		Результат.Вставить(Pow(2, ИндексДокумента), АтомарныеВидыДокументов[ИндексДокумента]);	
		Возврат Результат;
	КонецЕсли;
	
	Если Все = Истина Тогда
		Для СчетчикОбщий = 1 По Pow(2, ВсегоДокументов) - 1 Цикл
			СчетчикАтомарный = 0;	
			ПредставлениеМассив = Новый Массив;
			СоответствуетОтбору = Истина;
			Для Каждого Роль Из АтомарныеВидыДокументов Цикл
				Если ВидыДокументовПоддерживаемыеМП.Найти(СчетчикАтомарный) <> Неопределено Тогда				
					ВидЧисловой = Pow(2, СчетчикАтомарный);
					Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(СчетчикОбщий, ВидЧисловой, ВсегоДокументов) Тогда
						//@skip-check typed-value-adding-to-untyped-collection
						ПредставлениеМассив.Добавить(Роль);
						Если Отбор <> Неопределено И СчетчикАтомарный <> Отбор Тогда
							СоответствуетОтбору = Ложь;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
				СчетчикАтомарный = СчетчикАтомарный + 1;
			КонецЦикла;	
			Если СоответствуетОтбору = Истина И ПредставлениеМассив.Количество() > 0 Тогда
				Результат.Вставить(СчетчикОбщий, СтрСоединить(ПредставлениеМассив, ", ")); 
			КонецЕсли;
		КонецЦикла;
	Иначе
		СчетчикАтомарный = 0;
		Для Каждого ВидДокумента Из АтомарныеВидыДокументов Цикл		
			Если ВидыДокументовПоддерживаемыеМП.Найти(СчетчикАтомарный) <> Неопределено
				И (Отбор = Неопределено Или СчетчикАтомарный = Отбор) Тогда
				ВидЧисловой = Pow(2, СчетчикАтомарный);
				Результат.Вставить(ВидЧисловой, ВидДокумента);
			КонецЕсли;
			СчетчикАтомарный = СчетчикАтомарный + 1;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИнформацияПоТитулуМП(ДокументСсылка, РольУчастника, ТекущийТитул = Неопределено) Экспорт
	
	Результат = Новый Структура("ДоступноВМП, ТитулДоступенВМП, ЗаголовокПолей", Ложь, Ложь, "");
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная")
		И РольУчастника = 1 Тогда
			
		Результат.Вставить("ДоступноВМП", Истина);
		Если ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул2")
			Или ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул4") Тогда
			Результат.Вставить("ЗаголовокПолей", "По данным водителя");	
			Результат.Вставить("ТитулДоступенВМП", Истина);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЭлектронныйПутевойЛист")
		// Пока МП только для водителей, назначать может оформитель ЭПЛ 
		И ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(РольУчастника, 1) Тогда
				
		Результат.Вставить("ДоступноВМП", Истина);
		Если ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул2")
			Или ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул6") Тогда
			Результат.Вставить("ЗаголовокПолей", "По данным медработника");
		ИначеЕсли ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул3") Тогда
			Результат.Вставить("ЗаголовокПолей", "По данным контролера");
			Результат.Вставить("ТитулДоступенВМП", Истина);
		ИначеЕсли ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул4")
			Или ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул5") Тогда
			Результат.Вставить("ЗаголовокПолей", "По данным одометриста");
			Результат.Вставить("ТитулДоступенВМП", Истина);
		Иначе
			Результат.Вставить("ЗаголовокПолей", "По данным водителя");
			Результат.Вставить("ТитулДоступенВМП", Истина);
		КонецЕсли;
	
	КонецЕсли;
	
	СобытияПривязки = Новый Массив;
	СобытияПривязки.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВзаимодействияМПЭПД.ПривязкаВодителя")); 
	
	Результат.Вставить("СобытияПривязки", СобытияПривязки);
	
	Возврат Результат;	

	
КонецФункции

Функция КартинкаПустаяФотография() Экспорт
	
	Возврат БиблиотекаКартинок.ПустаяФотографияЭПД;
	
КонецФункции

Функция КартинкаМобильноеУстройствоЭПД() Экспорт
	
	Возврат БиблиотекаКартинок.МобильноеУстройствоЭПД;
	
КонецФункции

Функция КартинкаОткрытьВОкнеЭПД() Экспорт
	
	Возврат БиблиотекаКартинок.ОткрытьВОкнеЭПД;
	
КонецФункции

Функция КартинкаТелефоннаяТрубкаЭПД() Экспорт
	
	Возврат БиблиотекаКартинок.ТелефоннаяТрубкаЭПД;
	
КонецФункции

Функция КартинкаКоллекцияСобытияМобильногоПриложенияЭПД() Экспорт
	
	Возврат БиблиотекаКартинок.КоллекцияСобытияМобильногоПриложенияЭПД;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает индексы поддерщиваемых МП ролей пользователя по массиву, возвращаемого методом АтомарныеРолиМП
// 
// Параметры:
//  Все - Булево - если Ложь, тогда будут возвращены только атомарные роли
//  Отбор - Число - атомарная роль
// 
// Возвращаемое значение:
//  Массив из Число -- Роли (числовые) поддерживаемые мобильным приложением
Функция РолиПоддерживаемыеМП(Все = Ложь, Отбор = Неопределено) Экспорт
	
	ИндексыАтомарныхРолей = Новый Массив;
	
	Если ДокументПоддерживаетсяМП(ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭПЛ")) = Истина Тогда
		//@skip-check typed-value-adding-to-untyped-collection
		// Медработник пока не поддерживается с МП
		// ИндексыАтомарныхРолей.Добавить(1);
		//@skip-check typed-value-adding-to-untyped-collection
		ИндексыАтомарныхРолей.Добавить(2);
		//@skip-check typed-value-adding-to-untyped-collection
		ИндексыАтомарныхРолей.Добавить(3);
	КонецЕсли;
	//@skip-check typed-value-adding-to-untyped-collection
	ИндексыАтомарныхРолей.Добавить(4); 
	
	Если Все = Ложь Тогда
		Возврат ИндексыАтомарныхРолей;
	Иначе
		Результат = Новый Массив;
		АтомарныеРоли = АтомарныеРолиМП();	
		ВсегоРолей = АтомарныеРоли.Количество();
		Для СчетчикОбщий = 1 По Pow(2, ВсегоРолей) - 1 Цикл
			Для СчетчикАтомарный = 0 По ВсегоРолей Цикл
				Если ИндексыАтомарныхРолей.Найти(СчетчикАтомарный) <> Неопределено Тогда				
					РольЧисловая = Pow(2, СчетчикАтомарный);
					Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(СчетчикОбщий, РольЧисловая, ВсегоРолей) Тогда
						Если Отбор = Неопределено Или СчетчикАтомарный = Отбор Тогда
							Результат.Добавить(СчетчикОбщий);	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

// Возвращает индексы поддерщиваемых МП ролей пользователя по массиву, возвращаемого методом АтомарныеРолиМП
// 
// Параметры:
//  Все - Булево - если Ложь, тогда будут возвращены только атомарные виды документов
//  Отбор - Неопределено - атомарный вид документа
// 
// Возвращаемое значение:
//  Массив из Число - Виды документов поддерживаемые мобильным приложением
Функция ВидыДокументовПоддерживаемыеМП(Все = Ложь, Отбор = Неопределено) Экспорт
	
	ИндексыАтомарныхВидов = Новый Массив;
	
	//@skip-check typed-value-adding-to-untyped-collection
	ИндексыАтомарныхВидов.Добавить(0);
	Если ДокументПоддерживаетсяМП(ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭПЛ")) = Истина Тогда
		//@skip-check typed-value-adding-to-untyped-collection
		ИндексыАтомарныхВидов.Добавить(1);
	КонецЕсли;
	
	Если Все = Ложь Тогда
		Возврат ИндексыАтомарныхВидов;
	Иначе
		Результат = Новый Массив;
		АтомарныеВидыДокументов = АтомарныеВидыДокументовМП();	
		ВсегоВидов = АтомарныеВидыДокументов.Количество();
		Для СчетчикОбщий = 1 По Pow(2, ВсегоВидов) - 1 Цикл
			Для СчетчикАтомарный = 0 По ВсегоВидов Цикл
				Если ИндексыАтомарныхВидов.Найти(СчетчикАтомарный) <> Неопределено Тогда				
					ВидЧисловой = Pow(2, СчетчикАтомарный);
					Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(СчетчикОбщий, ВидЧисловой, ВсегоВидов) Тогда
						Если Отбор = Неопределено Или СчетчикАтомарный = Отбор Тогда
							Результат.Добавить(СчетчикОбщий);	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

Функция РольДелимаяПоДокументам()
	
	Возврат Pow(2, 4);
	
КонецФункции

Функция РольСУчетомВидовДокументов(Роль, ВидыДокументов) Экспорт
	
	АтомарныеВидыДокументовМП = АтомарныеВидыДокументовМП();
	ВсегоДокументов = АтомарныеВидыДокументовМП.Количество();
	РольДелимаяПоДокументам = РольДелимаяПоДокументам();
	
	Результат = Роль - РольДелимаяПоДокументам;
	Для СчетчикАтомарный = 0 По АтомарныеВидыДокументовМП.Количество() - 1 Цикл
		ВидЧисловой = Pow(2, СчетчикАтомарный);
		Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(ВидыДокументов, ВидЧисловой, ВсегоДокументов) Тогда
			Результат = Результат + РольДелимаяПоДокументам * Pow(2, СчетчикАтомарный);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РазделитьРольИВидыДокументов(Роль) Экспорт
	
	Результат = Новый Структура("Роль, ВидыДокументов", Роль, 0);
	
	АтомарныеРоли = АтомарныеРолиМП();	
	ВсегоРолей = АтомарныеРоли.Количество();
	
	АтомарныеВидыДокументовМП = АтомарныеВидыДокументовМП();
	ВсегоДокументов = АтомарныеВидыДокументовМП.Количество();
	РольДелимаяПоДокументам = РольДелимаяПоДокументам();
	
	ЕстьДелимаяРоль = Ложь;
	Для СчетчикАтомарный = 0 По АтомарныеВидыДокументовМП.Количество() - 1 Цикл
		ВидЧисловой = Pow(2, СчетчикАтомарный);
		Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Роль, РольДелимаяПоДокументам * ВидЧисловой, ВсегоРолей + ВсегоДокументов - 1) Тогда
			Результат.Роль = Результат.Роль - РольДелимаяПоДокументам * ВидЧисловой;	
			Результат.ВидыДокументов = Результат.ВидыДокументов + ВидЧисловой;
			ЕстьДелимаяРоль = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьДелимаяРоль Тогда
		Результат.Роль = Результат.Роль + РольДелимаяПоДокументам;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДокументПоддерживаетсяМП(ДокументЭПД)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокументЭПД) = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная")
		Или ДокументЭПД = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭТрН") Тогда
		Результат = Истина;
	ИначеЕсли ТипЗнч(ДокументЭПД) = Тип("ДокументСсылка.ЭлектронныйПутевойЛист")
		Или ДокументЭПД = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭПЛ") Тогда
		Результат = Истина; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
